---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightOffset
source: html/d8b824e7-c8e6-9fc1-dd03-7368cf7fc84b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightOffset Property

"Base Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingHeightOffset { get; }
```